v2206/multiphase_solverComparisons/bubbleColumnMulti/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// vertices
// (
//     (0 0 0)
//     (0.15 0 0)
//     (0.15 1 0)
//     (0 1 0)
//     (0 0 0.1)
//     (0.15 0 0.1)
//     (0.15 1 0.1)
//     (0 1 0.1)
// );

// blocks
// (
//     hex (0 1 2 3 4 5 6 7) (25 75 1) simpleGrading (1 1 1)
// );

vertices
(
    (0.0    0.0   0.0)
    (0.04   0.0   0.0)
    (0.04   0.16  0.0)
    (0.0    0.16  0.0)
    (0.0    0.0   0.0002)
    (0.04   0.0   0.0002)
    (0.04   0.16  0.0002)
    (0.0    0.16  0.0002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (128 256 1)
    simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )
    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
