v2206/multiphase_solverComparisons/bubbleColumnMulti/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingMultiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          1e-5;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

functions
{
    // fieldAverage1
    // {
    //     type            fieldAverage;
    //     libs            (fieldFunctionObjects);
    //     writeControl    writeTime;
    //     fields
    //     (
    //         U.air
    //         {
    //              mean        on;
    //              prime2Mean  off;
    //              base        time;
    //         }

    //         U.water
    //         {
    //              mean        on;
    //              prime2Mean  off;
    //              base        time;
    //         }

    //         alpha.air
    //         {
    //              mean        on;
    //              prime2Mean  off;
    //              base        time;
    //         }

    //         p
    //         {
    //              mean        on;
    //              prime2Mean  off;
    //              base        time;
    //         }
    //     );
    // }
}


// ************************************************************************* //
