v2206/multiphase_solverComparisons/bubbleColumnMulti/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
);

regions
(
    // boxToCell
    // {
    //     box (0 0 -0.1) (0.15 0.701 0.1);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.air 0
    //         volScalarFieldValue alpha.water 1
    //     );
    // }

    boxToCell
    {
        box (0 0 0) (1 0.12 1);
        fieldValues
        (
            volScalarFieldValue alpha.water    1
            volScalarFieldValue alpha.air       0
        );
    }
);


// ************************************************************************* //
